{"podcast_details": {"podcast_title": "Capitol Call", "episode_title": "CAPITOL CALL 5-19-23", "episode_image": "https://d3wo5wojvuv7l.cloudfront.net/t_rss_itunes_square_1400/images.spreaker.com/original/78fd6d8b4bdbe8a7556f87684ad7044d.jpg", "episode_transcript": " Good morning, good morning, good morning, and welcome, welcome, welcome. It is time now for our capital call brought to you by Phillips 66. We have our quorum and we're doing this remotely today. We're doing this by telephone because our lawmakers are very busy. And what is this? It's called a concurrent session, Senator? Well, we're in the regular session that ends a week from tomorrow, but we have gone into a concurrent session at the same time. We have a regular gavel out of the regular gavel into the special. This is so that after we vote on the budget bills, there will be enough legislative days left in the special session for us to override any possible veto of the budget bills by the governor. So we may be fine and not have to come back at all. But if he does veto some, we've designated a day in June that we can come back and override any vetoes we want to address. Very good. So we've already got your reaction to the education bill. So I'm going to go around the horn here. First of all, Judd Strom, your reaction to the education package was agreed upon. You know, I think you've heard it plenty of times and I'll say the same thing, but it's a snort. We're giving more money to public education than we have. You know, some people are for that. Some I know are against. I've heard they don't want to do that. But you know, that's one of our main, one of the biggest things we do here at the capital and education is one of our biggest agencies that we fund and our largest employer. And we've had a couple of great years. And as far as I was concerned, I was like, it was just something that we absolutely had to do this year. So I'm glad to get that across the board. And I think our schools and our kids will all benefit from that. Glad to be a part of it. Representative Cain, your perspective. Well, I have a very similar take. It is definitely historic. And you know, I did read some numbers that we've actually in the last six years funded more money towards public education than was funded in the 27 years prior to that. So it's definitely an investment. You know, we often hear complaints about the shortage of funding, needing more and more. But I think that we've clearly shown we put our money where our mouth is. Education is, I've never talked to a single person that doesn't think education is finally important. Now, you could talk about it, but it all needs to be in public. I do like the component that we've added this year, just honestly. We've added the little school choice opportunity in there. And I believe that is really sound and strong for a transformational change for our education, just to give a better opportunity to as many children as we can. And that's what I'm all about. Very good. Senator, I understand that the governor has been getting some writer's cramp, doing some signing and vetoing and everything. I understand now he has to go to work. Yes, he's still signing. I spoke with the office today about one of my bills. They wanted some information. Judd has the statistics here in front of him. But I he is continuing to do some vetoes, but I think they're based on policy. We gave a nickname to the ones that he did a couple of weeks ago. We were calling them the tantrum 20. And of course, Tom, we don't know how many bills we will override because both the House and the Senate have to do it. We overrode his veto of one of my bills, but the House has not yet decided whether or not they will vote on it. So unless both chambers vote to override the veto stands. But Judd's got the numbers here. Judd, what do you have there? Give me a happy math. Just before we come in to look into what we're at, you know, we're on the second to the last Friday here. He's signed so far 252 bills. So those will go on and go into law. And then he has vetoed 43 so far. And we, yes, we've got another week, but there are a lot of bills just going into conference committee, a lot of bills still being held up just before they were sent on that direction. So we don't know what the final tally will be. But that's where we're at right now. So we have 252 signed and 43 vetoed. And you'll remember, I bring this number up a lot, but outside of joint resolutions and SJRs and all of that, there were 3049 just clean bills, pieces of legislation when we started here in February. So we're down from 3049 to about 290 that have had final action here at the end of session so far. Representative Cain, this is, I guess, what they call the grind session. How's your learning curve here on grind time? Well, you know, I will say the entire atmosphere did change here when the education agreement was done. It's really a much more pleasant environment to be in. I think there's more cooperation. We're going to move forward. So no, it is a grind because it's the deadline. The deadline is what puts all the pressure on. But I'm going to take your role. I'm going to ask our senior members a question myself. 43 vetoes from the governor. I don't know how, what would be vetoed in your camp? Was it anywhere near that number? Do you remember? Gosh, John. I'm sorry I asked a question. I'm old enough. I can claim that I can't remember. I'm not sure if that, I was just trying to get a feel if it's a higher number than normal because I don't know. But I shouldn't have asked that question. I think it is a higher number. Probably with the tantrum 20 at least. Possibly. Nevertheless, I am, I'm just so happy we got the education done. I hope we can get some other things across the finish line now that everybody's trying to, the long jam is broken and we'll see where it can come up. And I think the budget's proceeding. I know they're going to start to run budget bills. Our appropriations chairman told us today that he's done. He's not talking to anybody else about adding any more money or any new project. In fact, he said today he is refusing to meet with any lobbyists anymore. He's done. Well, you can do that. I was going to ask you, Judd. Yeah, I guess we all could. Well, we're going in at 330 this afternoon, the chairs and vice chairs of our budget committees with our final, final asks for our budget chairman. And so we, the nine of us and then the vice chairs of courts are going to sit down at the table for the last time. And then I'm sure that door will be closed as well after that meeting because that's going to be the last, our last opportunity to kind of lobby for what we've worked on since I've worked on since last June. Right. Really those budget numbers. And a lot of things won't get funded because the education piece was such a large piece of what recurring revenues we could appropriate. So that's really limiting some of the other budget asks. Just real quick, let you know, some of the other things that are going on. So we were in Senate today, we do all these executive confirmations. So on the floor this morning, we confirmed 47 Oklahomans to different boards and commissions. And if you're a tier one, we have to take each one separately. Most of them we can read all of them out and vote at once. And then we also, I got noticed that our oversight of administrative rules is really having an effect. So far, pharmacy, wildlife, public safety and cosmetology have all pulled proposed rules because they were running into a headwind with those of us who were reviewing the rules. So they did the smart thing and they just pulled them and left to fight another day. So we're having a real effect on boards and commissions and agencies being careful about what kind of rules they try to promulgate and put on people because we're paying closer attention than we used to. We are listening, folks, to our capital call. It's brought to you by Phillips 66 right here on K1, the one you trust. We're doing this long distance today because our lawmakers are not getting a whole lot of sleep, but they're getting done a whole lot of the people's work. I want to go to Representative John B. Kaine. John, you're a business fellow, you got some business experience, putting together a business budget and putting together a state budget. Any similarities whatsoever? Yes, there must be. I thought the silence was the answer. No, I'll just be very frank. I have not been able to be as involved at this point in the numbers, the hard numbers in the budget. I'm going to get it presented to me, but I've not been in a position to really form this budget. I would like that opportunity in future years, but I guess as a freshman I'm kind of in my place. So my answer is yes, it must be similar, but I wasn't in the room to give you a first person account. Judd, I'm going to ask you on the thing with the budget here. You've been hinting that you've been trying to work around, of course, the big thing, which was the education agreement, and trying to get done whatever you could or put something that could possibly be in place. Are you running out of places now with the agreement or are things starting to kind of come together a little bit? I know you'll know more after 3.30 this afternoon. Well, things are really starting to come together. One of the things we have to wait for as we're going on through the years is what policy bills come through with a fiscal impact. When we start with 3,049 bills and half of those cost money, you really have to pay attention to what bills are crossing the floor because then you're going to have to come back and pay for it. But at this time of year, we can look back and see what's made it, what hasn't made it, what we're going to have to pay for versus what we paid for last year, what we knew was coming in to be able to spend. But right here in the end, it really has come together because there have been a lot of headbutts in this building. Believe it or not, 150 kind of class presidents all trying to argue it out gets pretty tense for a little while. But with the education bill passed and the dam kind of coming down, we've all come together. So we've got to get something done. We've got to get something done fast. Which is that the best way to do it or not? Probably not. I'm not going to answer that, but we are getting things, we are going to get it done because constitutionally, we have to be out of here by 5 o'clock next Friday. So we've got to get that done. The government could make a legislative thing as long as you want. Didn't they do that back in history? Well, you can do that up until constitutionally Friday at 5 o'clock and the Gallow Bangs at 5 next Friday. It's over. Even with all the spins, and this is what I'm really anxious to see as I see the budget numbers, because we've seen lots of numbers thrown out of how much money we have, the revenue numbers in. I still haven't given up on the idea of tax reform or tax cut done the right way going forward. So until I see these numbers, I can't speak real and tell something on it, but I have a gut feeling there's still going to be some room. And I would love to see us continue down that road. I get the feeling that you probably will see one or two or three that come up that chute as far as doing that, John. I mean, that's just an observer on the outside. Wishful thinking, I guess, but it would be nice. Yes, it would. Senator, what do you have up here on your windshield besides trying to get this thing taken care of and get home for a little bit? Well, yesterday I began work again on our pro-life bill, rewriting. We've rewritten it to reflect the very horrible decision handed down by the Supreme Court that created a limited right to abortion in our Constitution to preserve the life of the mother. Preserving the life of the mother has been in our statute since 1910. But they created this right. They made no mention of the unborn child. They just talked about the woman. So we are taking their decision, rewriting the bill that I tried to run back in February and March. And if we can get the votes in the House and Senate, the leaders, the floor leaders have both said we can bring it to the floor. So several of the other lady senators and representatives and I are starting to work that bill this afternoon, starting to explain it to people because I'm terribly fearful. I think I'm really alarmed at this point that once we leave this building, the Supreme Court will say they didn't do anything to stop us or to warn us. So we're going to go ahead and put on our black robe legislator costumes and we're just going to be a super legislature and put abortion in the Constitution. And then all their laws are null and void. Wow. OK. That's a picture. Wow. John B. What you got coming at you? Oh, I think we've already just talked about. I'm going to be voting on budget bills tomorrow and I'll have some reading to do tonight. And I'm just looking forward to that process because I think that's going to be very educational for me. I'm excited to get right in the middle of it. Judd, any last words? Same. We're working on budget right up until the end and then I've actually already started with some of my committee members about budget work when we go into the summer and when to come back and talk about that and some interim studies for the Labor Department, several other organizations. We're going to start. I mean, right when we get out of here, we go back to work for next year. Oh my. It never ends. I want to thank you three very much for getting together in a very small room, gathering around the telephone and making this radio show possible today. I know you have a lot of work to do, but thanks for taking time out for us right here on Capitol Call."}, "podcast_summary": "In this podcast, the lawmakers discuss their current legislative session and various bills. They mention the education bill and how it is receiving more funding than ever before. They also discuss the governor's vetoing of bills and the possibility of overriding them. The lawmakers mention the budget and the challenges they face in allocating funds to different projects. They also talk about the effect they are having on boards and commissions with their oversight of administrative rules. Lastly, they mention the importance of tax reform and the work they are doing on a pro-life bill.", "podcast_guest": "Judd Strom", "podcast_highlights": "- Highlight 1: \"We're giving more money to public education than we have. You know, some people are for that. Some I know are against. I've heard they don't want to do that. But you know, that's one of our main, one of the biggest things we do here at the capital and education is one of our biggest agencies that we fund and our largest employer. And we've had a couple of great years. And as far as I was concerned, I was like, it was just something that we absolutely had to do this year.\"\n- Highlight 2: \"Well, I have a very similar take. It is definitely historic. And you know, I did read some numbers that we've actually in the last six years funded more money towards public education than was funded in the 27 years prior to that. So it's definitely an investment. You know, we often hear complaints about the shortage of funding, needing more and more. But I think that we've clearly shown we put our money where our mouth is. Education is, I've never talked to a single person that doesn't think education is finally important. Now, you could talk about it, but it all needs to be in public. I do like the component that we've added this year, just honestly. We've added the little school choice opportunity in there. And I believe that is really sound and strong for a transformational change for our education, just to give a better opportunity to as many children as we can. And that's what I'm all about.\"\n- Highlight 3: \"You know, they're still signing. I spoke with the office today about one of my bills. They wanted some information. Judd has the statistics here in front of him. But I he is continuing to do some vetoes, but I think they're based on policy. We gave a nickname to the ones that he did a couple of weeks ago. We were calling them the tantrum 20. And of course, Tom, we don't know how many bills we will override because both the House and the Senate have to do it. We overrode his veto of one of my bills, but the House has not yet decided whether or not they will vote on it. So unless both chambers vote to override the veto stands.\"\n- Highlight 4: \"Just before we come in to look into what we're at, you know, we're on the second to the last Friday here. He's signed so far 252 bills. So those will go on and go into law. And then he has vetoed 43 so far. And we, yes, we've got another week, but there are a lot of bills just going into conference committee, a lot of bills still being held up just before they were sent on that direction. So we don't know what the final tally will be. But that's where we're at right now. So we have 252 signed and 43 vetoed.\"\n- Highlight 5: \"Well, things are really starting to come together. One of the things we have to wait for as we're going on through the years is what policy bills come through with a fiscal impact. When we start with 3,049 bills and half of those cost money, you really have to pay attention to what bills are crossing the floor because then you're going to have to come back and pay for it. But at this time of year, we can look back and see what's made it, what hasn't made it, what we're going to have to pay for versus what we paid for last year, what we knew was coming in to be able to spend. But right here in the end, it really has come together because there have been a lot of headbutts in this building. Believe it or not, 150 kind of class presidents all trying to argue it out gets pretty tense for a little while. But with the education bill passed and the dam kind of coming down, we've all come together. So we've got to get something done. We've got to get something done fast.\""}