{"podcast_details": {"podcast_title": "LatamList Espresso", "episode_title": "Klar raises $100M credit facility, Ep 146", "episode_image": "https://d3wo5wojvuv7l.cloudfront.net/t_rss_itunes_square_1400/images.spreaker.com/original/3b05ef3d1bb15e63758ec4bcc4fb7d22.jpg", "episode_transcript": " Good morning, this is Aracely Dominguez and you're listening to the Latam Less Espresso where we give you a quick shout-out of news about what's happening this week in Latin America's startup ecosystem. This is the week of August 22nd and the year is 2023. Bamboo Payment announced a partnership with Rite Halling platform Indrive. The company will offer instant payment services to Indrive's customers in Argentina, Peru and Chile. Flar raised a $100 million credit facility from Victory Park Capital. With the funds, the company will provide credit access and financial services to the underserved population in Mexico. Auto Labs secured a $4.1 million round led by Vertical Venture Partners and Heaven Ventures. With the funds, the company will bring its software to more auto shops in Colombia and Mexico. Scape announced its expansion to Colombia. The company provides an app that enables users to book at-home spa services. Dock partnered with the digital bank Tempo to enter the Chilean market. Dock will supply the financial infrastructure behind the issuing and processing technology that Tempo is using for its new credit cards. OnePay introduced a new payment method that integrates directly with WhatsApp, eliminating intermediaries and simplifying payments. Wonder Brands secured a $15.5 million in a Series A round led by Nazca and BitLab. The funds, the Mexico-based company, will continue its expansion in South America. Matera acquired Cinecta, a prominent data intelligence company specializing in customer loyalty and profitability solutions. This acquisition advances Matera's goal on enriching customer experiences in the financial sector. Take a look at ProColumbia's feature article in which they highlight some of the most notable startups in fintech, cybersecurity, agritech, and haltech in Colombia. Also check out Banta's article on how to achieve fast SOC2 compliance. Stay updated on the latest Latam Tech news by visiting latamless.com, where you can subscribe to our weekly newsletter for a summary of the week's biggest headlines. If you enjoyed this episode and would like to support the Latamless Espresso, spread the word by leaving us a review on your favorite podcast platform. This podcast was produced by Latamless Media. If you have a podcast you'd like to be featured or produced, contact us via our website. This has been the Latamless Espresso. Tune in next week to find out what's going on in Latin America's startup ecosystem."}, "podcast_summary": "In the latest episode of Latam Less Espresso, several noteworthy developments in Latin America's startup ecosystem were highlighted. Bamboo Payment announced a partnership with Indrive, providing instant payment services in Argentina, Peru, and Chile. Flar secured a $100 million credit facility to offer financial services to underserved populations in Mexico. Auto Labs received $4.1 million in funding to expand its software to auto shops in Colombia and Mexico. Scape expanded to Colombia, offering at-home spa services through its app. Dock entered the Chilean market by partnering with Tempo to provide financial infrastructure for new credit cards. OnePay introduced a payment method integrated with WhatsApp, simplifying payments. Wonder Brands received $15.5 million in funding to continue expanding in South America. Matera acquired Cinecta to enhance customer experiences in the financial sector. Additionally, ProColumbia featured notable startups in fintech, cybersecurity, agritech, and haltech in Colombia. To stay updated on the latest news, visit latamless.com and subscribe to their weekly newsletter.", "podcast_guest": "Aracely Dominguez", "podcast_highlights": "- Highlight 1 of the podcast: \"Bamboo Payment announced a partnership with Rite Halling platform Indrive, offering instant payment services to Argentina, Peru, and Chile.\"\n- Highlight 2 of the podcast: \"Flar raised a $100 million credit facility to provide financial services to underserved populations in Mexico.\"\n- Highlight 3 of the podcast: \"Auto Labs secured a $4.1 million round to expand its software to more auto shops in Colombia and Mexico.\"\n- Highlight 4 of the podcast: \"Scape announced its expansion to Colombia, providing an app for booking at-home spa services.\"\n- Highlight 5 of the podcast: \"Dock partnered with Tempo to enter the Chilean market, supplying financial infrastructure for Tempo's new credit cards.\""}